#
# .zsh_plugins.txt - antidote plugin list
#

# Completion system (must be first — before plugins that call compdef)
mattmc3/ez-compinit

# Completions (fpath only, loaded by compinit)
zsh-users/zsh-completions kind:fpath path:src

# Prompt (sourced directly; avoids promptinit's fpath scan)
sindresorhus/pure

# zsh4humans-style fzf completion menu (loads after compinit, before autosuggest)
Aloxaf/fzf-tab

# Editor / typing
hlissner/zsh-autopair
romkatv/zsh-no-ps2

# Extra git subcommands (sourced from mattmc3's repo)
mattmc3/git-cmds kind:path

# Autosuggestions (sync — works on first keystroke)
zsh-users/zsh-autosuggestions

# History substring search (binds keys via post: hook)
zsh-users/zsh-history-substring-search post:bindkey-hss

# vi: ft=properties
